Repository: PereiraASRG/corona-de-en-alignment
Catalog: de 4_eng 4.tmx
Source language: de
Languages: en

source: Das BMG engagiert sich aktiv in verschiedenen internationalen Foren und fördert die Zusammenarbeit zwischen Akteuren aus dem Stiftungswesen, dem privaten und öffentlichen Bereich.
en: BMG is actively involved in various international forums and promotes cooperation between stakeholders from the foundation system as well as from the public and private sectors.

source: Zudem leistet das BMG mit den Behörden in seinem Geschäftsbereich (RKI und PEI) Unterstützung im Sinne von internationalen Wissenstransfers.
en: In addition, BMG, in collaboration with the respective authorities, provides support within the boundaries of their remit (RKI and PEI) to aid the international transfer of knowledge.

source: So u.a. im Rahmen der folgenden Projekte und Gremienarbeit: Das RKI ist vertreten in der „Regional Working Group on COVID19 vaccination and deployment“ der WHO EURO und der “WHO/SAGE COVID-19 vaccine working group”.
en: This includes, among others, the project and committee-based work outlined below. RKI is represented in the WHO/Europe Regional Working Group on Covid-19 Vaccination and Deployment and also in the WHO SAGE Working Group on Covid-19 Vaccines.

source: Im ECDC koordinierten EU Netzwerk Nationaler Impfkommissionen führt das RKI federführend einen “living systematic review” zur Wirksamkeit und Sicherheit der COVID-19 Impfstoffe durch und unterstützt damit maßgeblich die Entscheidungsfindung zur COVID-19 Impfstrategie in anderen EU-Ländern.
en: In the ECDC-coordinated EU Network of National Vaccination Commissions, RKI is the lead organisation in a “living systematic review” on the efficacy and safety of the Covid-19 vaccines and thus provides key input to aid decision-making concerning the Covid-19 vaccination strategies in other EU countries.

source: Das PEI unterstützt als Kollaborationszentrum für Impfstoffe und Blutprodukte u.a. die WHO sowie regulatorische Behörden der afrikanischen Partnerländer, WHO Afro sowie regulatorische Gremien der Afrikanischen Union bei der Etablierung von Strukturen und Verfahren, um die Genehmigung und Durchführung von klinischen Studien für Arzneimittel und Impfstoffe zu fördern und eine effektive Pharmakovigilanz bei der Anwendung von Arzneimitteln aufzubauen.
en: As a collaboration centre for vaccines and blood products, PEI supports, among others, the WHO, the regulatory authorities in African partner countries, WHO Afro and regulatory bodies of the African Union in establishing structures and procedures to promote the approval and implementation of clinical trials for medicines and vaccines and to establish effective pharmacovigilance in the use of medical products.
